In [1]:
import pandas as pd # pd is the alias name

In [4]:
# How to create a series object from list 

my_list = ['a','b','c','d','e']

print(type(my_list))

<class 'list'>

In [6]:
first_series = pd.Series(my_list)

print(first_series)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [10]:
labels = ["Raj","Beu","Ashu","Siri"]

emp_id_list = [101,102,103,104]

emp_series = pd.Series(data = emp_id_list)

In [11]:
emp_series

0    101
1    102
2    103
3    104
dtype: int64

In [12]:
emp_series_with_label = pd.Series(data = emp_id_list , index = labels)

emp_series_with_label

Raj     101
Beu     102
Ashu    103
Siri    104
dtype: int64

In [13]:
# how to create series from a numpy array?
import numpy as np

num_array = np.array([1,2,3,4,5,6])

In [14]:
num_series = pd.Series(num_array)

print(num_series)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [15]:
# How to createa series from a dictionary

dict_fruit_quant = {"Bananas": 100, "Avacados": 50 , "Mangoes" : 200}

Series_fruit_quant = pd.Series(dict_fruit_quant)
Series_fruit_quant

Bananas     100
Avacados     50
Mangoes     200
dtype: int64

In [17]:
print("The number of dimensions in a series object:")
Series_fruit_quant.ndim

The number of dimensions in a series object:

1

In [18]:
Series_fruit_quant["Bananas"] # using label

100

In [19]:
Series_fruit_quant[0] # using index

100

In [25]:
# How to select values in series objects

# --iloc: Index location: Uses indeces
# --loc: location: uses labels
        
Series_fruit_quant.iloc[1] # only sqaure braces to be used

50

In [22]:
Series_fruit_quant.iloc[1]

50

In [27]:
Series_fruit_quant.loc["Bananas"]

100

In [28]:
Series_fruit_quant[1]

50

In [31]:
first_series

0    a
1    b
2    c
3    d
4    e
dtype: object

In [30]:
first_series.loc[2] # 2 is a lebel

'c'

In [35]:
first_series = pd.Series([1,2,3,4], index = ['a','b','c','d'])
second_series = pd.Series([10,20,30,40], index = ['a','b','c','d'])

first_series * second_series

a     10
b     40
c     90
d    160
dtype: int64

# Datafreames in Pandas

In [36]:
olympic_data_list = {"HostCity" : ["Tokyo","London","Beijing","Athens","Sydney","Atlanta"],
                    "Year":[2021,2012,2008,2004,2000,1996],
                    "No. Of Participating Countries":[202,205,204,201,200,197]}
print(olympic_data_list)

{'HostCity': ['Tokyo', 'London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'], 'Year': [2021, 2012, 2008, 2004, 2000, 1996], 'No. Of Participating Countries': [202, 205, 204, 201, 200, 197]}

In [38]:
# How to create datframe from dictionary?

# the 2 dimensional labeled datastructure of pandas is calles dataframe. every column in a dataframe is a series object

olympic_df = pd.DataFrame(olympic_data_list)
olympic_df # below is just a view of a dataframe

  HostCity  Year  No. Of Participating Countries
0    Tokyo  2021                             202
1   London  2012                             205
2  Beijing  2008                             204
3   Athens  2004                             201
4   Sydney  2000                             200
5  Atlanta  1996                             197

In [40]:
print(type(olympic_df))

<class 'pandas.core.frame.DataFrame'>

In [41]:
olympic_df["Year"]

0    2021
1    2012
2    2008
3    2004
4    2000
5    1996
Name: Year, dtype: int64

In [43]:
cols_list = ["Year","HostCity"]

olympic_df[cols_list]

   Year HostCity
0  2021    Tokyo
1  2012   London
2  2008  Beijing
3  2004   Athens
4  2000   Sydney
5  1996  Atlanta

In [44]:
olympic_df[["Year","HostCity"]]

   Year HostCity
0  2021    Tokyo
1  2012   London
2  2008  Beijing
3  2004   Athens
4  2000   Sydney
5  1996  Atlanta

In [51]:
olympic_df.iloc[0:2,0:2] # the first value rows and second value columns

  HostCity  Year
0    Tokyo  2021
1   London  2012

In [52]:
olympic_df.loc[0:2,0:2]  # throws error because 0:2 is not column label

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

In [59]:
olympic_df.loc[0:2,["HostCity","Year"]]

  HostCity  Year
0    Tokyo  2021
1   London  2012
2  Beijing  2008

In [63]:
olympic_df.loc[0::2,["HostCity","Year"]]

  HostCity  Year
0    Tokyo  2021
2  Beijing  2008
4   Sydney  2000

# Attributes of dataframe

<ul>
    <li>dtypes
    <li>columns
        <li>shape
        <li>axes
        <li>size
        <li>ndim
        <li>T

In [64]:
olympic_df.columns # list of all clumns

Index(['HostCity', 'Year', 'No. Of Participating Countries'], dtype='object')

In [65]:
olympic_df.dtypes # datatypes

HostCity                          object
Year                               int64
No. Of Participating Countries     int64
dtype: object

In [67]:
olympic_df.axes # indeces of both rows and columns

[RangeIndex(start=0, stop=6, step=1),
 Index(['HostCity', 'Year', 'No. Of Participating Countries'], dtype='object')]

In [69]:
olympic_df.shape # represent rows and columns

(6, 3)

In [70]:
olympic_df.size # total number of elements

18

In [71]:
olympic_df.ndim # number of dimension

2

In [72]:
olympic_df.T # tranmspose data

,0,1,2,3,4,5
HostCity,Tokyo,London,Beijing,Athens,Sydney,Atlanta
Year,2021,2012,2008,2004,2000,1996
No. Of Participating Countries,202,205,204,201,200,197

# Dataframe methods to explore the dataset

In [73]:
olympic_df.head() # by default it will retrives the first 5

  HostCity  Year  No. Of Participating Countries
0    Tokyo  2021                             202
1   London  2012                             205
2  Beijing  2008                             204
3   Athens  2004                             201
4   Sydney  2000                             200

In [74]:
olympic_df.tail() # by default it will retrives the last 5

  HostCity  Year  No. Of Participating Countries
1   London  2012                             205
2  Beijing  2008                             204
3   Athens  2004                             201
4   Sydney  2000                             200
5  Atlanta  1996                             197

In [75]:
olympic_df.head(n=3) # number of records from first 3

  HostCity  Year  No. Of Participating Countries
0    Tokyo  2021                             202
1   London  2012                             205
2  Beijing  2008                             204

In [76]:
olympic_df.tail(n=2) # by default it will retrives the last 2

  HostCity  Year  No. Of Participating Countries
4   Sydney  2000                             200
5  Atlanta  1996                             197

In [78]:
olympic_df.describe() # gives the statistical summary and only numerics columns

              Year  No. Of Participating Countries
count     6.000000                        6.000000
mean   2006.833333                      201.500000
std       8.953584                        2.880972
min    1996.000000                      197.000000
25%    2001.000000                      200.250000
50%    2006.000000                      201.500000
75%    2011.000000                      203.500000
max    2021.000000                      205.000000

In [80]:
olympic_df.describe(include="all")

       HostCity         Year  No. Of Participating Countries
count         6     6.000000                        6.000000
unique        6          NaN                             NaN
top      Athens          NaN                             NaN
freq          1          NaN                             NaN
mean        NaN  2006.833333                      201.500000
std         NaN     8.953584                        2.880972
min         NaN  1996.000000                      197.000000
25%         NaN  2001.000000                      200.250000
50%         NaN  2006.000000                      201.500000
75%         NaN  2011.000000                      203.500000
max         NaN  2021.000000                      205.000000

In [81]:
olympic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   HostCity                        6 non-null      object
 1   Year                            6 non-null      int64
 2   No. Of Participating Countries  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

# how to apply a function on a dataframe

<UI>
    <li>applymap
        <li>apply

In [82]:
df_movie = pd.DataFrame({"movie_1":[5,4,3,5,1],"movie_2":[2,3,4,5,1]},index=["Tom","Jeff","Peter","Ram","Paul"])

In [83]:
df_movie

       movie_1  movie_2
Tom          5        2
Jeff         4        3
Peter        3        4
Ram          5        5
Paul         1        1

In [89]:
# we are defining a function to assign corresponding grades for the ratings
def movie_grade(rating):
    if rating == 5:
        return "A"
    if rating == 4:
        return "B"
    if rating == 3:
        return "C"
    else:
        return "F"

In [94]:
movie_rating = 4

if movie_rating == 5:
    print("this movie is great")
else:
         print("The movie is average")

The movie is average

# Now lets see how we can apply this function on our dataframe

In [95]:
df_movie.applymap(movie_grade) # apply functions on dataframe

      movie_1 movie_2
Tom         A       F
Jeff        B       C
Peter       C       B
Ram         A       A
Paul        F       F

In [97]:
df_movie['movie_1'].apply(movie_grade) # apply function only on specific columns

Tom      A
Jeff     B
Peter    C
Ram      A
Paul     F
Name: movie_1, dtype: object

In [98]:
df_movie

       movie_1  movie_2
Tom          5        2
Jeff         4        3
Peter        3        4
Ram          5        5
Paul         1        1

In [100]:
df_movie.max() # retrieves the max value of all numerical columns

movie_1    5
movie_2    5
dtype: int64

In [102]:
df_movie["movie_1"].max()

5

In [103]:
df_movie.min()

movie_1    1
movie_2    1
dtype: int64

In [104]:
df_movie["movie_2"].min()

1

In [106]:
df_movie["movie_1"].mean()

3.6

In [107]:
df_movie.mean()

movie_1    3.6
movie_2    3.0
dtype: float64

In [108]:
df_movie.std()

movie_1    1.673320
movie_2    1.581139
dtype: float64

In [109]:
df_movie["movie_1"].std()

1.6733200530681511

In [110]:
df_movie["movie_1"].idxmax()

'Tom'

In [111]:
df_movie["movie_1"].argmax() # label of max value

0

In [112]:
df_movie["movie_1"].values.argmax() # after converting the series column to numpy array, arg() returning

0

In [113]:
df_movie["movie_1"].argmin() # label of minimum value

4

# How to export a dataframe

In [114]:
df_movie.to_csv("movie_ratings.csv") # always specify the file expension

# How to import a csv file ionto the Jupyter env

In [116]:
movie_ratings_df = pd.read_csv("movie_ratings.csv")

In [117]:
movie_ratings_df

  Unnamed: 0  movie_1  movie_2
0        Tom        5        2
1       Jeff        4        3
2      Peter        3        4
3        Ram        5        5
4       Paul        1        1

In [125]:
movie_ratings_df.rename(columns={'Unnamed: 0': 'Reviewer_name'}, inplace =True)

In [126]:
movie_ratings_df

  Reviewer_name  movie_1  movie_2
0           Tom        5        2
1          Jeff        4        3
2         Peter        3        4
3           Ram        5        5
4          Paul        1        1

In [127]:
pwd

'C:\\Users\\ukurara\\OneDrive - Pearson PLC\\Python'

In [129]:
import os
#full path
dir_path = os.path.dirname(os.path.realpath("movie_ratings.csv"))

#current dir
cwd = os.getcwd()

In [130]:
print(dir_path)

C:\Users\ukurara\OneDrive - Pearson PLC\Python

In [131]:
print(cwd)

C:\Users\ukurara\OneDrive - Pearson PLC\Python

In [132]:
pwd

'C:\\Users\\ukurara\\OneDrive - Pearson PLC\\Python'

# How to combine different datasets

In [133]:
#Define a dictionary containing Student data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Chennai'], 
        } 
   
#Define a dictionary containing Student data 
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Chennai'], 
        }

In [134]:
# convert dict to df

data1_df = pd.DataFrame(data1, index = [0,1,2,3])
data2_df = pd.DataFrame(data2, index = [0,1,2,3])

In [135]:
data1_df

     Name  Age    Address
0     Jai   27     Nagpur
1  Princi   24     Kanpur
2  Gaurav   22  Allahabad
3    Anuj   32    Chennai

In [136]:
data2_df

     Name  Age    Address
0    Abhi   17     Nagpur
1  Ayushi   14     Kanpur
2  Dhiraj   12  Allahabad
3  Hitesh   52    Chennai

# How to use the .concat() method

In [142]:
df_name_list = [data1_df,data2_df]

concat_dfs = pd.concat(df_name_list)

print("the concatenated stuident data is:")
print(concat_dfs)

the concatenated stuident data is:
     Name  Age    Address
0     Jai   27     Nagpur
1  Princi   24     Kanpur
2  Gaurav   22  Allahabad
3    Anuj   32    Chennai
0    Abhi   17     Nagpur
1  Ayushi   14     Kanpur
2  Dhiraj   12  Allahabad
3  Hitesh   52    Chennai

In [138]:
df_name_list

[     Name  Age    Address
 0     Jai   27     Nagpur
 1  Princi   24     Kanpur
 2  Gaurav   22  Allahabad
 3    Anuj   32    Chennai,
      Name  Age    Address
 0    Abhi   17     Nagpur
 1  Ayushi   14     Kanpur
 2  Dhiraj   12  Allahabad
 3  Hitesh   52    Chennai]

 # how to use append function

In [143]:
append_dfs = data1_df.append(data2_df)

In [144]:
append_dfs

     Name  Age    Address
0     Jai   27     Nagpur
1  Princi   24     Kanpur
2  Gaurav   22  Allahabad
3    Anuj   32    Chennai
0    Abhi   17     Nagpur
1  Ayushi   14     Kanpur
2  Dhiraj   12  Allahabad
3  Hitesh   52    Chennai

In [145]:
#Define a dictionary containing Student data 
data1 = {"Student_Id" :[101,102,103,104],
    'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Chennai'], 
        } 
   
#Define a dictionary containing Student data 
data2 = { "Student_Id" :[105,106,107,108],
    'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Chennai'], 
        }

In [146]:
# using .merge() function
merged_dfs = pd.merge(studentdf1,student_df2, on='Student_Id)
                      
merged_dfs

SyntaxError: EOL while scanning string literal (<ipython-input-146-9a96eff0e286>, line 2)